app/Models/ModeloGeneral.php

    public function obtenerUsuarioPorCorreo($correo)
    {
        // Conexión directa a la base de datos
        $db = \Config\Database::connect();

        // Consulta para obtener el usuario por correo
        $query = $db->table('tbl_usuarios')->where('correo_electronico', $correo)->get();

        return $query->getRowArray(); // Devuelve el usuario como un array o null si no lo encuentra
---
SELECT *
FROM `tbl_usuarios`
WHERE `correo_electronico` = 'lxmoreno@pucesi.edu.ec'

    public function obtenerDatosPaciente($id_paciente)
    {
        return $this->db->table('casos_clinicos')
            ->where('id', $id_paciente)
            ->get()
            ->getRow();
---
SELECT *
FROM `casos_clinicos`
WHERE `id` = '3'

    public function obtenerHistorialClinicoPorPaciente($id_paciente)
    {
        return $this->db->table('historial_clinico_detalle')
            ->where('id', $id_paciente)
            ->get()
            ->getResult();
---
SELECT *
FROM `historial_clinico_detalle`
WHERE `id` = '3'

    public function ObtenerCasos($nombre = '', $cedula = '', $fecha = '')
    {
        $builder = $this->db->table('casos_clinicos');

        if (!empty($nombre)) {
            $builder->like('nombres_apellidos', $nombre);
        }
        if (!empty($cedula)) {
            $builder->where('cedula', $cedula);
        }
        if (!empty($fecha)) {
            $fecha_inicio = $fecha . ' 00:00:00';
            $fecha_fin = $fecha . ' 23:59:59';
            $builder->where('fecha_registro >=', $fecha_inicio);
            $builder->where('fecha_registro <=', $fecha_fin);
        }

        $query = $builder->get();
---
SELECT *
FROM `casos_clinicos`
WHERE `fecha_registro` >= '2025-09-02 00:00:00'
AND `fecha_registro` <= '2025-09-02 23:59:59'